; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v6 - type_1 ?v2 - type_3)
 	      (pred_4 ?v8 - object ?v2 - type_3)
	      (pred_1 ?v6 - type_1 ?v1 - type_2)
	      (pred_3 ?v6 - type_1 ?v8 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v6 - type_1 ?v7 ?v3 - type_3)
       :precondition (and  (pred_2 ?v6 ?v7))
       :effect (and  (pred_2 ?v6 ?v3)
		     (not (pred_2 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_1 ?v4 - object ?v5 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v5) (pred_2 ?v6 ?v5) (pred_1 ?v6 ?v1))
       :effect (and (pred_3 ?v6 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v5)) 
		    (not (pred_1 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_1 ?v4 - object ?v5 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v4 ?v1) (pred_2 ?v6 ?v5))
       :effect (and (pred_4 ?v4 ?v5)
		    (pred_1 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v4 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_05 - type_1
obj_08 obj_03 obj_01 obj_09 - type_2
obj_10 obj_04 obj_02 obj_13 - type_3
obj_06 obj_12 obj_07 obj_14 - object)
(:init
(pred_2 obj_11 obj_02)
(pred_1 obj_11 obj_08)
(pred_1 obj_11 obj_03)
(pred_2 obj_05 obj_10)
(pred_1 obj_05 obj_01)
(pred_1 obj_05 obj_09)
(pred_4 obj_06 obj_02)
(pred_4 obj_12 obj_13)
(pred_4 obj_07 obj_04)
(pred_4 obj_14 obj_10)
)
(:goal
(and
(pred_4 obj_06 obj_04)
(pred_4 obj_12 obj_02)
(pred_4 obj_07 obj_02)
(pred_4 obj_14 obj_04)
)
)

(:constraints
  (always (not (pred_2 obj_11 obj_13)))
)
)

; plan
1. (op_3 obj_05 obj_14 obj_10 obj_09)
   deleted: (pred_4 obj_14 obj_10) (pred_1 obj_05 obj_09)
   added: (pred_3 obj_05 obj_14 obj_09)
   goals met: 0 of 4
2. (op_3 obj_11 obj_06 obj_02 obj_03)
   deleted: (pred_4 obj_06 obj_02) (pred_1 obj_11 obj_03)
   added: (pred_3 obj_11 obj_06 obj_03)
   goals met: 0 of 4
3. (op_1 obj_05 obj_10 obj_04)
   deleted: (pred_2 obj_05 obj_10)
   added: (pred_2 obj_05 obj_04)
   goals met: 0 of 4
4. (op_1 obj_11 obj_02 obj_04)
   deleted: (pred_2 obj_11 obj_02)
   added: (pred_2 obj_11 obj_04)
   goals met: 0 of 4
5. (op_2 obj_05 obj_14 obj_04 obj_09)
   deleted: (pred_3 obj_05 obj_14 obj_09)
   added: (pred_4 obj_14 obj_04) (pred_1 obj_05 obj_09)
   goals met: 1 of 4
6. (op_2 obj_11 obj_06 obj_04 obj_03)
   deleted: (pred_3 obj_11 obj_06 obj_03)
   added: (pred_4 obj_06 obj_04) (pred_1 obj_11 obj_03)
   goals met: 2 of 4
7. (op_3 obj_11 obj_07 obj_04 obj_08)
   deleted: (pred_4 obj_07 obj_04) (pred_1 obj_11 obj_08)
   added: (pred_3 obj_11 obj_07 obj_08)
   goals met: 2 of 4
8. (op_1 obj_11 obj_04 obj_02)
   deleted: (pred_2 obj_11 obj_04)
   added: (pred_2 obj_11 obj_02)
   goals met: 2 of 4
9. (op_1 obj_05 obj_04 obj_13)
   deleted: (pred_2 obj_05 obj_04)
   added: (pred_2 obj_05 obj_13)
   goals met: 2 of 4
10. (op_2 obj_11 obj_07 obj_02 obj_08)
   deleted: (pred_3 obj_11 obj_07 obj_08)
   added: (pred_4 obj_07 obj_02) (pred_1 obj_11 obj_08)
   goals met: 3 of 4
11. (op_3 obj_05 obj_12 obj_13 obj_09)
   deleted: (pred_4 obj_12 obj_13) (pred_1 obj_05 obj_09)
   added: (pred_3 obj_05 obj_12 obj_09)
   goals met: 3 of 4
12. (op_1 obj_05 obj_13 obj_02)
   deleted: (pred_2 obj_05 obj_13)
   added: (pred_2 obj_05 obj_02)
   goals met: 3 of 4
13. (op_2 obj_05 obj_12 obj_02 obj_09)
   deleted: (pred_3 obj_05 obj_12 obj_09)
   added: (pred_4 obj_12 obj_02) (pred_1 obj_05 obj_09)
   goals met: 4 of 4
